Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	
	// Способ 1: перебор значений в цикле
	СуммаДокумента = 0;
	Для Каждого СтрокаДокумента Из Продукты Цикл
		СуммаДокумента = СуммаДокумента + (СтрокаДокумента.Цена * СтрокаДокумента.Количество);
	КонецЦикла;
	
	// Способ 2: Он был-бы рабочим, если-бы была колонка Сумма
	//СуммаДокумента = Продукты.Итог("Сумма");
	
	// Способ 3: В данном случае неудачный и не применимый т.к. чтение происходит до записи, и при запросе в таблице не будет данных
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	СУММА(ПокупкаПродукты.Количество * ПокупкаПродукты.Цена) КАК Сумма
	//	|ИЗ
	//	|	Документ.Покупка.Продукты КАК ПокупкаПродукты
	//	|ГДЕ
	//	|	ПокупкаПродукты.Ссылка = &Ссылка";
	//
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//	СуммаДокумента = ВыборкаДетальныеЗаписи.Сумма;
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Проверяем, нужно-ли проводить документ(содержит-ли он табличную часть)
	Если Продукты.Количество() = 0 Тогда
		Сообщить("Внимание! Документ не содержит строк! Проведение невозможно!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Установим флаг сохранения движений по регистру Продукты
	Движения.Продукты.Записывать = Истина;
	Движения.Затраты.Записывать = Истина;
	
	// Выбираем данные из документа с помощью запроса
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПокупкаПродукты.Продукт КАК Продукт,
	               |	СУММА(ПокупкаПродукты.Количество) КАК Количество,
	               |	СУММА(ПокупкаПродукты.Количество * ПокупкаПродукты.Цена) КАК Сумма
	               |ИЗ
	               |	Документ.Покупка.Продукты КАК ПокупкаПродукты
	               |ГДЕ
	               |	ПокупкаПродукты.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПокупкаПродукты.Продукт
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Продукт
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	// Формируем движения/записи регистра
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.Продукты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период      = Дата;
		Движение.Продукт     = ВыборкаДетальныеЗаписи.Продукт;
		Движение.Количество  = ВыборкаДетальныеЗаписи.Количество;
		Движение.Сумма       = ВыборкаДетальныеЗаписи.Сумма;

	КонецЦикла;
	
	// Запишем сумму в затраты
	ДвижениеЗатрат = Движения.Затраты.Добавить();
	ДвижениеЗатрат.Период  = Дата;
	ДвижениеЗатрат.Магазин = Магазин;
	ДвижениеЗатрат.Сумма   = СуммаДокумента;
	
КонецПроцедуры
